rrainey/ArduinoCore-samd/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

menu.cache=Cache
menu.speed=CPU Speed
menu.opt=Optimize
menu.maxqspi=Max QSPI
menu.usbstack=USB Stack
menu.debug=Debug

# DSKY-matic Alarm M0 (SAMD21)
# ------------------------------
dskyalarm_m0.name=DSKY-matic Alarm M0
dskyalarm_m0.vid.0=0x1209
dskyalarm_m0.pid.0=0x2021
dskyalarm_m0.upload.tool=bossac
dskyalarm_m0.upload.protocol=sam-ba
dskyalarm_m0.upload.maximum_size=262144
dskyalarm_m0.upload.offset=0x2000
dskyalarm_m0.upload.use_1200bps_touch=true
dskyalarm_m0.upload.wait_for_upload_port=true
dskyalarm_m0.upload.native_usb=true
dskyalarm_m0.build.mcu=cortex-m0plus
dskyalarm_m0.build.f_cpu=48000000L
dskyalarm_m0.build.usb_product="DSKY-matic Alarm M0"
dskyalarm_m0.build.usb_manufacturer="Riley Rainey"
dskyalarm_m0.build.board=TRINKET_M0
dskyalarm_m0.build.core=arduino
dskyalarm_m0.build.extra_flags=-DCRYSTALLESS -DADAFRUIT_TRINKET_M0 -D__SAMD21E18A__ -DARM_MATH_CM0PLUS {build.usb_flags}
dskyalarm_m0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
dskyalarm_m0.build.openocdscript=openocd_scripts/trinket_m0.cfg
dskyalarm_m0.build.variant=dskyalarm_m0
dskyalarm_m0.build.variant_system_lib=
dskyalarm_m0.build.vid=0x1209
dskyalarm_m0.build.pid=0x2021
dskyalarm_m0.bootloader.tool=openocd
dskyalarm_m0.bootloader.file=dskyalarmM0/bootloader-dskyalarm_m0-v3.10.0-19-g5a54c81.bin
dskyalarm_m0.menu.usbstack.arduino=Arduino
dskyalarm_m0.menu.usbstack.tinyusb=TinyUSB
dskyalarm_m0.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
dskyalarm_m0.menu.debug.off=Off
dskyalarm_m0.menu.debug.on=On
dskyalarm_m0.menu.debug.on.build.flags.debug=-g


# DSKY-matic Keyboard M0 (SAMD21)
# ------------------------------
dskykeyboard_m0.name=DSKY-matic Keyboard M0
dskykeyboard_m0.vid.0=0x1209
dskykeyboard_m0.pid.0=0x2022
dskykeyboard_m0.upload.tool=bossac
dskykeyboard_m0.upload.protocol=sam-ba
dskykeyboard_m0.upload.maximum_size=262144
dskykeyboard_m0.upload.offset=0x2000
dskykeyboard_m0.upload.use_1200bps_touch=true
dskykeyboard_m0.upload.wait_for_upload_port=true
dskykeyboard_m0.upload.native_usb=true
dskykeyboard_m0.build.mcu=cortex-m0plus
dskykeyboard_m0.build.f_cpu=48000000L
dskykeyboard_m0.build.usb_product="DSKY-matic Keyboard M0"
dskykeyboard_m0.build.usb_manufacturer="Riley Rainey"
dskykeyboard_m0.build.board=TRINKET_M0
dskykeyboard_m0.build.core=arduino
dskykeyboard_m0.build.extra_flags=-DCRYSTALLESS -DADAFRUIT_TRINKET_M0 -D__SAMD21E18A__ -DARM_MATH_CM0PLUS {build.usb_flags}
dskykeyboard_m0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
dskykeyboard_m0.build.openocdscript=openocd_scripts/trinket_m0.cfg
dskykeyboard_m0.build.variant=dskykeyboard_m0
dskykeyboard_m0.build.variant_system_lib=
dskykeyboard_m0.build.vid=0x1209
dskykeyboard_m0.build.pid=0x2022
dskykeyboard_m0.bootloader.tool=openocd
dskykeyboard_m0.bootloader.file=dskykeyboardM0/bootloader-dskykeyboard_m0-v3.10.0-19-g5a54c81.bin
dskykeyboard_m0.menu.usbstack.arduino=Arduino
dskykeyboard_m0.menu.usbstack.tinyusb=TinyUSB
dskykeyboard_m0.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
dskykeyboard_m0.menu.debug.off=Off
dskykeyboard_m0.menu.debug.on=On
dskykeyboard_m0.menu.debug.on.build.flags.debug=-g
